"use stricts";
//1. Вивести на екран всі числа від 1 до 10 за допомогою циклу while.
let f = 1;

while (f < 10) {
  console.log(`f: ${f}`);
  f++;
}

//2. Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue.

let j = 0;
while (j <= 20) {
  console.log(j);
  j += 2;
}

//3.Вивести на екран таблицю множення числа 7 за допомогою циклу for.

const application = 65;
let sum = 1;
for (let g = 14; g < application; g += 7) {
  sum++;
  console.log(g);
}
console.log(sum);
const maxNum = 7;
for (let g = 0; g > 7; g++) {
  console.log(`${maxNum} * ${g} =`, maxNum * g);
}

//4.Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.
let y = 1;
while (y <= 5) {
  console.log(y);
  y++;
}

//?5.Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

for (let h = 0; h < 10; h++) {
  if (h === 7) {
    console.log(h);
    break;
  }
}

//?6.Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = 9;
while (n > 9) {
  console.log(n);
  break;
}

//7.За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let number = 0;
while (number <= 20) {
  console.log(number);
  number += 3;
}
